# Pandas Tutorial

## Series

In [1]:
# Pandas Tutorial 2020 by Derek Banas:- https://www.youtube.com/watch?v=PcvsOaixUh8

In [1]:
import numpy as np
import pandas as pd

In [3]:
list_1 = ['a', 'b', 'c', 'd']
labels = [1, 2, 3, 4]

ser_1 = pd.Series(data=list_1, index=labels)
ser_1

1    a
2    b
3    c
4    d
dtype: object

In [4]:
arr_1 = np.array([1,2,3,4])
ser_2 = pd.Series(arr_1)
ser_2

0    1
1    2
2    3
3    4
dtype: int32

In [5]:
dict_1 = {'f_name':'Harshad', 'l_name':'Shringi', 'age':29}
ser_3 = pd.Series(dict_1)
ser_3

f_name    Harshad
l_name    Shringi
age            29
dtype: object

In [6]:
ser_3.keys()

Index(['f_name', 'l_name', 'age'], dtype='object')

In [7]:
# VV Important  
ser_3.values

array(['Harshad', 'Shringi', 29], dtype=object)

In [8]:
dict_1.values()

dict_values(['Harshad', 'Shringi', 29])

In [9]:
ser_3['f_name'] +' '+ ser_3['l_name'] +' with age: '+ str(ser_3['age'])

'Harshad Shringi with age: 29'

In [10]:
for k,v in dict_1.items():
    print(k,v)

f_name Harshad
l_name Shringi
age 29

In [11]:
ser_2.dtype

dtype('int32')

In [12]:
ser_3.dtype

dtype('O')

In [13]:
# add opertaion on series
# All operations can be performed on series of same dataType
ser_2 + ser_2

0    2
1    4
2    6
3    8
dtype: int32

In [14]:
np.exp(ser_2)

0     2.718282
1     7.389056
2    20.085537
3    54.598150
dtype: float64

In [15]:
ser_4 = pd.Series({4: 5, 5: 6, 6: 7, 7: 8})
ser_2 + ser_4

# does not not align so doesn't get added up.

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
7   NaN
dtype: float64

In [16]:
ser_4 = pd.Series({4: 5, 5: 6, 6: 7, 7: 8}, name='rand_nums')
ser_4.name

'rand_nums'

## Dataframes

### Creating DataFrames

In [17]:
arr_2 = np.random.randint(10, 50, size=(2,3))
arr_2

array([[43, 10, 34],
       [44, 46, 30]])

In [18]:
arr_2 = np.random.randint(10, 50, size=(2,3))
df_1 = pd.DataFrame(arr_2, ['A','B'], ['C','D','E'])
df_1

    C   D   E
A  34  16  14
B  39  36  13

In [ ]:
# pd.DataFrame(data, [index], [columns])

In [19]:
print(df_1.shape)

(2, 3)

In [20]:
dict_3 = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']), 
             'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df_2 = pd.DataFrame(dict_3)
df_2

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [21]:
dict_4 = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']), 
             'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd']),
                 'three': pd.Series([1., 2., 3., 4.,5.], index=['a', 'b', 'c', 'd','e'])}
df_3 = pd.DataFrame(dict_4)
df_3

   one  two  three
a  1.0  1.0    1.0
b  2.0  2.0    2.0
c  3.0  3.0    3.0
d  NaN  4.0    4.0
e  NaN  NaN    5.0

In [22]:
pd.DataFrame.from_dict(dict([('A', [1,2,3]), ('B', [4,5,6])]))

   A  B
0  1  4
1  2  5
2  3  6

In [23]:
pd.DataFrame.from_dict(dict([('A', [1,2,3]), ('B', [4,5,6])]), 
                      orient='index', columns=['one', 'two', 'three'])

   one  two  three
A    1    2      3
B    4    5      6

### Editing and Retrieving data

In [24]:
print(df_1)

    C   D   E
A  34  16  14
B  39  36  13

In [25]:
df_1['C']

A    34
B    39
Name: C, dtype: int32

In [26]:
df_1[['D', 'E']]

    D   E
A  16  14
B  36  13

In [27]:
df_1.loc['A']                   # loc = it will be accessed by 'index-name'

C    34
D    16
E    14
Name: A, dtype: int32

In [28]:
df_1.iloc[1]                     # iloc = it will be accessed by 'index-value'

C    39
D    36
E    13
Name: B, dtype: int32

In [29]:
df_1.loc['A', 'C']

34

In [30]:
df_1.loc[['A','B'],['D','E']]

    D   E
A  16  14
B  36  13

In [31]:
df_1['Total'] = df_1['C']+ df_1['D']+ df_1['E']
df_1

    C   D   E  Total
A  34  16  14     64
B  39  36  13     88

In [32]:
print(df_2)
df_2['Mul'] = df_2['one']*df_2['two']
df_2

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

   one  two  Mul
a  1.0  1.0  1.0
b  2.0  2.0  4.0
c  3.0  3.0  9.0
d  NaN  4.0  NaN

In [33]:
dict_new = {'C':10, 'D':20, 'E':30}
new_row = pd.Series(dict_new, name='F')
df_1 = df_1.append(new_row)
df_1

      C     D     E  Total
A  34.0  16.0  14.0   64.0
B  39.0  36.0  13.0   88.0
F  10.0  20.0  30.0    NaN

In [34]:
df_1.drop('F', axis=0, inplace=True)

In [35]:
df_1.drop('Total', axis=1, inplace=True)

In [36]:
df_1

      C     D     E
A  34.0  16.0  14.0
B  39.0  36.0  13.0

In [37]:
# setting new index

df_1['Gender'] = ['Men', 'Woman']
df_1.set_index('Gender', inplace=True)
df_1

           C     D     E
Gender
Men     34.0  16.0  14.0
Woman   39.0  36.0  13.0

In [38]:
df_1.reset_index(inplace=True)

In [39]:
df_2

   one  two  Mul
a  1.0  1.0  1.0
b  2.0  2.0  4.0
c  3.0  3.0  9.0
d  NaN  4.0  NaN

In [40]:
df_2.assign(div=df_2['one'] / df_2['two'])

   one  two  Mul  div
a  1.0  1.0  1.0  1.0
b  2.0  2.0  4.0  1.0
c  3.0  3.0  9.0  1.0
d  NaN  4.0  NaN  NaN

In [41]:
df_2.assign(sub= lambda x: (x['two'] - (x['one'])))

   one  two  Mul  sub
a  1.0  1.0  1.0  0.0
b  2.0  2.0  4.0  0.0
c  3.0  3.0  9.0  0.0
d  NaN  4.0  NaN  NaN

In [42]:
df_01 = pd.DataFrame({'A': [1., np.nan, 3., np.nan]})
df_02 = pd.DataFrame({'A': [10., 11., 3., 12.]})

df_01.combine_first(df_02)

# NaN values get replaced by other df_02 values

      A
0   1.0
1  11.0
2   3.0
3  12.0

### Conditional Selection

In [43]:
arr_2 = np.random.randint(10, 50, size=(2,3))
# arr_2

df_1 = pd.DataFrame(arr_2, ['A','B'], ['C','D','E'])
df_1

# print("Greater than 40\n", df_1 > 40)

# lt ge le eq ne
print("Greater than 40\n", df_1.gt(40.0))

bool_1 = df_1 >= 30.0
df_1[bool_1]

df_1['E']>40

df_1[df_1['E'] > 30]

df_2 = df_1[df_1['E'] > 30]
df_2['C']

print(df_1[df_1['E'] > 20][['C','D','E']])

Greater than 40
        C      D      E
A  False  False   True
B  False  False  False
    C   D   E
A  27  20  45
B  30  17  31

In [44]:
arr_3 = np.array([[1,2,3],[4,5,6], [7,8,9]])
df_2 = pd.DataFrame(arr_3, ['A','B', 'C'], ['X','Y','Z'] )
df_2

df_2[(df_2['X']>3) & (df_2['X']<7)]

   X  Y  Z
B  4  5  6

## File Input/Output

In [49]:
cs_df = pd.read_csv('ComputerSales.csv')
cs_df
cs_df.to_csv('ComputerSalesBU1.csv')

In [53]:
# pip install xlrd
# pip install openpyxl

pd.read_excel('Financial Sample.xlsx', 0)
cs_df.to_excel('ComputerSalesBU.xlsx')

#checking new excel file
pd.read_excel('ComputerSalesBU.xlsx')

# Just get 1 column of data 
cs_df_state = pd.read_excel('ComputerSalesBU.xlsx', usecols=['State'], squeeze=True)
cs_df_state

0     OH
1     WV
2     PA
3     PA
4     PA
5     PA
6     OH
7     OH
8     OH
9     WV
10    PA
11    OH
12    PA
13    PA
14    OH
15    PA
16    OH
17    NY
18    PA
19    NY
20    PA
21    PA
22    OH
23    WV
24    NY
25    PA
26    OH
27    PA
28    PA
29    WV
30    PA
31    OH
32    PA
33    OH
34    NY
35    NY
36    PA
37    PA
38    PA
Name: State, dtype: object

#### MySQL query

In [55]:
import pymysql
'''
# Read from MySQL Database
try:
    db_connection = pymysql.connect(db='students', user='studentadmin', 
                                        passwd='TurtleDove', host='localhost', port=3306)

    stud_df = pd.read_sql('SELECT * FROM students', con=db_connection)
    # print(stud_df)
except Exception as e:
    print("Exception : {}".format(e))
finally:
    db_connection.close()
    

# Write to table 
try:
    db_connection = pymysql.connect(db='students', user='studentadmin', passwd='TurtleDove', host='localhost', port=3306)
    # Used to issue queries
    cursor = db_connection.cursor()
    # Query to enter new student
    insert_stmt = "INSERT INTO students VALUES(NULL, 'Frank', 'Silva', 'fsilva@aol.com', '666 Hell St', 'Yakima', 'WA', 98901, '792-223-8966', '1959-2-22', 'M', NOW(), 3.50)"
    # Execute query
    cursor.execute(insert_stmt)
    # Commit changes to DB
    db_connection.commit()
    stud_df = pd.read_sql('SELECT * FROM students', con=db_connection)
    print(stud_df)
except Exception as e:
    print("Exception : {}".format(e))
finally:
    db_connection.close()
    
'''

## Basics and Maths

In [56]:
cs_df.head()

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018
3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018

In [57]:
cs_df.tail()

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year
34,35,Michelle Samms,F,46,NY,MY2J2LL,Tablet,999.99,146.69,Website,April,2020
35,36,Sally Struthers,F,45,NY,81TC00,Laptop,649.99,122.34,Website,April,2020
36,37,Jason Case,M,57,PA,M01-F0024,Desktop,479.99,143.39,Flyer 4,April,2020
37,38,Doug Johnson,M,51,PA,GA401IV,Laptop,1349.99,180.34,Website,May,2020
38,39,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,May,2020

In [58]:
cs_df[:2]

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018

In [59]:
cs_df[:5:2]

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018

In [60]:
cs_df.index.array

<PandasArray>
[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18,
 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37,
 38]
Length: 39, dtype: int64

In [62]:
cs_df.to_numpy()

array([[1, 'Paul Thomas', 'M', 43, 'OH', 'M01-F0024', 'Desktop', 479.99,
        143.39, 'Website', 'January', 2018],
       [2, 'Margo Simms', 'F', 37, 'WV', 'GT13-0024', 'Desktop', 1249.99,
        230.89, 'Flyer 4', 'January', 2018],
       [3, 'Sam Stine', 'M', 26, 'PA', 'I3670', 'Desktop', 649.99,
        118.64, 'Website', 'February', 2018],
       [4, 'Moe Eggert', 'M', 35, 'PA', 'I3593', 'Laptop', 399.99, 72.09,
        'Website', 'March', 2018],
       [5, 'Jessica Elk', 'F', 55, 'PA', '15M-ED', 'Laptop', 699.99,
        98.09, 'Flyer 4', 'March', 2018],
       [6, 'Sally Struthers', 'F', 45, 'PA', 'GT13-0024', 'Desktop',
        1249.99, 230.89, 'Flyer 2', 'April', 2018],
       [7, 'Michelle Samms', 'F', 46, 'OH', 'GA401IV', 'Laptop', 1349.99,
        180.34, 'Email', 'May', 2018],
       [8, 'Mick Roberts', 'M', 23, 'OH', 'MY2J2LL', 'Tablet', 999.99,
        146.69, 'Website', 'July', 2018],
       [9, 'Ed Klondike', 'M', 52, 'OH', '81TC00', 'Laptop', 649.99,
        122.34, 'Email', 'July', 2018],
       [10, 'Phil Jones', 'M', 56, 'WV', 'M01-F0024', 'Desktop', 479.99,
        143.39, 'Flyer 2', 'August', 2018],
       [11, 'Rick James', 'M', 49, 'PA', 'GA401IV', 'Laptop', 1349.99,
        180.34, 'Flyer 3', 'November', 2018],
       [12, 'Sue Etna', 'F', 54, 'OH', 'GT13-0024', 'Desktop', 1249.99,
        230.89, 'Flyer 2', 'November', 2018],
       [13, 'Jason Case', 'M', 57, 'PA', '81TC00', 'Laptop', 649.99,
        122.34, 'Email', 'November', 2018],
       [14, 'Doug Johnson', 'M', 51, 'PA', 'I3670', 'Desktop', 649.99,
        118.64, 'Website', 'December', 2018],
       [15, 'Andy Sands', 'M', 56, 'OH', 'MY2J2LL', 'Tablet', 999.99,
        146.69, 'Flyer 1', 'December', 2018],
       [16, 'Kim Collins', 'F', 49, 'PA', 'I3593', 'Laptop', 399.99,
        72.09, 'Flyer 2', 'January', 2019],
       [17, 'Edna Sanders', 'F', 46, 'OH', '15M-ED', 'Laptop', 699.99,
        98.09, 'Email', 'February', 2019],
       [18, 'Michelle Samms', 'F', 46, 'NY', 'MY2J2LL', 'Tablet', 999.99,
        146.69, 'Website', 'March', 2019],
       [19, 'Mick Roberts', 'M', 23, 'PA', 'I3593', 'Laptop', 399.99,
        72.09, 'Flyer 4', 'March', 2019],
       [20, 'Sally Struthers', 'F', 45, 'NY', '81TC00', 'Laptop', 649.99,
        122.34, 'Website', 'April', 2019],
       [21, 'Jason Case', 'M', 57, 'PA', 'M01-F0024', 'Desktop', 479.99,
        143.39, 'Flyer 4', 'May', 2019],
       [22, 'Doug Johnson', 'M', 51, 'PA', 'GA401IV', 'Laptop', 1349.99,
        180.34, 'Website', 'August', 2019],
       [23, 'Paul Thomas', 'M', 43, 'OH', '81TC00', 'Laptop', 649.99,
        122.34, 'Website', 'August', 2019],
       [24, 'Margo Simms', 'F', 37, 'WV', 'Q526FA', 'Laptop', 1049.99,
        143.09, 'Flyer 4', 'November', 2019],
       [25, 'Michelle Samms', 'F', 46, 'NY', 'I3670', 'Desktop', 649.99,
        118.64, 'Flyer 2', 'November', 2019],
       [26, 'Mick Roberts', 'M', 23, 'PA', 'Q526FA', 'Laptop', 1049.99,
        143.09, 'Email', 'November', 2019],
       [27, 'Ed Klondike', 'M', 52, 'OH', 'Q526FA', 'Laptop', 1049.99,
        143.09, 'Website', 'December', 2019],
       [28, 'Moe Eggert', 'M', 35, 'PA', '15M-ED', 'Laptop', 699.99,
        98.09, 'Email', 'December', 2019],
       [29, 'Jessica Elk', 'F', 55, 'PA', 'GA401IV', 'Laptop', 1349.99,
        180.34, 'Flyer 2', 'December', 2019],
       [30, 'Phil Jones', 'M', 56, 'WV', 'M01-F0024', 'Desktop', 479.99,
        143.39, 'Flyer 2', 'January', 2020],
       [31, 'Rick James', 'M', 49, 'PA', 'GA401IV', 'Laptop', 1349.99,
        180.34, 'Flyer 1', 'January', 2020],
       [32, 'Sue Etna', 'F', 54, 'OH', 'GT13-0024', 'Desktop', 1249.99,
        230.89, 'Flyer 2', 'February', 2020],
       [33, 'Kim Collins', 'F', 49, 'PA', 'I3593', 'Laptop', 399.99,
        72.09, 'Flyer 2', 'March', 2020],
       [34, 'Edna Sanders', 'F', 46, 'OH', '15M-ED', 'Laptop', 699.99,
        98.09, 'Email', 'March', 2020],
       [35, 'Michelle Samms', 'F', 46, 'NY', 'MY2J2LL', 'Tablet', 999.99,
        146.69, 'Website', 'April', 2020],
       [36, 'Sally Struthers', 'F', 45, 'NY', '81TC00', 'Laptop', 649.99,
        122.34, 'Website', 'April', 2020],
       [37, 'Jason Case', 'M', 57, 'PA', 'M01-F0024', 'Desktop', 479.99,
        143.39, 'Flyer 4', 'April', 2020],
       [38, 'Doug Johnson', 'M', 51, 'PA', 'GA401IV', 'Laptop', 1349.99,
        180.34, 'Website', 'May', 2020],
       [39, 'Moe Eggert', 'M', 35, 'PA', 'I3593', 'Laptop', 399.99,
        72.09, 'Website', 'May', 2020]], dtype=object)

In [63]:
ser_1.array

<PandasArray>
['a', 'b', 'c', 'd']
Length: 4, dtype: object

In [92]:
dict_3 = {'one': pd.Series([1.,2.,3.], index=['a','b','c']),
          'two': pd.Series([1.,2.,3.,4.], index=['a','b','c','d'])}
df_2 = pd.DataFrame(dict_3)
print(df_2)

print(df_2.fillna(0, inplace=True))

row = df_2.iloc[1]
print(df_2.add(row, axis='columns'))

col = df_2['two']
print(df_2.sub(col, axis=0))

df_2.empty

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0
None
   one  two
a  3.0  3.0
b  4.0  4.0
c  5.0  5.0
d  2.0  6.0
   one  two
a  0.0  0.0
b  0.0  0.0
c  0.0  0.0
d -4.0  0.0

False

In [109]:
df_5 = pd.DataFrame({'A' : range(3), 'B' : range(1,4)})
print(df_5)

df_5.add(1)
# OR
df_5.transform(lambda x: x+1)
df_5.transform(lambda x: x**2)
df_5.transform(lambda x: np.sqrt(x))
df_5.transform([lambda x: x**2, lambda x: x**3])
df_5.transform({'A': lambda x: x**2, 'B': lambda x: x**3})
df_5['A'].map( lambda x: x**4)
df_5.applymap(lambda x: x**2)

df_2['two'].unique()
df_2['two'].nunique()
df_2['two'].value_counts()
df_2.columns
df_2.index
df_2.isnull()

   A  B
0  0  1
1  1  2
2  2  3

     one    two
a  False  False
b  False  False
c  False  False
d  False  False

## Group Data

In [111]:
dict_5 = {'Store': [1,2,1,2], 'Flavour':['choc', 'van', 'straw', 'mint'],
         'Sales': [26,12,18,22]}
df_11 = pd.DataFrame(dict_5)
df_11

   Store Flavour  Sales
0      1    choc     26
1      2     van     12
2      1   straw     18
3      2    mint     22

In [122]:
by_store = df_11.groupby('Store')
print(by_store.mean())

print('----------------------')

print(by_store.sum().loc[1])
print(by_store.sum().loc[2])

print('----------------------')

print(by_store.describe())

       Sales
Store
1         22
2         17
----------------------
Sales    44
Name: 1, dtype: int64
Sales    34
Name: 2, dtype: int64
----------------------
      Sales
      count  mean       std   min   25%   50%   75%   max
Store
1       2.0  22.0  5.656854  18.0  20.0  22.0  24.0  26.0
2       2.0  17.0  7.071068  12.0  14.5  17.0  19.5  22.0

## Concatenate Merge and Join Data

In [124]:
df_12 = pd.DataFrame({'A': [1,2,3], 'B': [4,5,6]}, index=[1,2,3])

df_13 = pd.DataFrame({'A': [7,8,9], 'B': [10,11,12]}, index=[4,5,6])

pd.concat([df_12, df_13])

   A   B
1  1   4
2  2   5
3  3   6
4  7  10
5  8  11
6  9  12

In [130]:
df_12 = pd.DataFrame({'A': [1,2,3], 'B': [4,5,6], 'key':[1,2,3]})

df_13 = pd.DataFrame({'A': [7,8,9], 'B': [10,11,12], 'key':[1,2,3]})

pd.merge(df_12, df_13, how='inner', on='key')

pd.merge(df_12, df_13, how='outer', on='key')

   A_x  B_x  key  A_y  B_y
0    1    4    1    7   10
1    2    5    2    8   11
2    3    6    3    9   12

In [131]:
df_12 = pd.DataFrame({'A': [1,2,3], 'B': [4,5,6]}, index=[1,2,3])

df_13 = pd.DataFrame({'C': [7,8,9], 'D': [10,11,12]}, index=[1,4,5])

df_12.join(df_13, how='outer')

     A    B    C     D
1  1.0  4.0  7.0  10.0
2  2.0  5.0  NaN   NaN
3  3.0  6.0  NaN   NaN
4  NaN  NaN  8.0  11.0
5  NaN  NaN  9.0  12.0

## Statistics

In [134]:
ics_df = pd.read_csv('icecreamsales.csv')
ics_df

    Temperature  Sales
0            37    292
1            40    228
2            49    324
3            61    376
4            72    440
5            79    496
6            83    536
7            81    556
8            75    496
9            64    412
10           53    324
11           40    320

In [135]:
ics_df.count()

Temperature    12
Sales          12
dtype: int64

In [156]:
ics_df.sum()
ics_df.sum(skipna=True)

ics_df['Sales'].mean()
ics_df['Sales'].median()
ics_df['Sales'].mode()
ics_df['Sales'].min()
ics_df['Sales'].max()
ics_df['Sales'].product()
ics_df['Sales'].std()
ics_df['Sales'].var()
ics_df['Sales'].sem()
ics_df['Sales'].skew()
ics_df['Sales'].kurt()
ics_df['Sales'].quantile(.5)
ics_df['Sales'].cumsum()
ics_df['Sales'].cummax()
ics_df['Sales'].cummin()

ics_df.describe()

       Temperature       Sales
count    12.000000   12.000000
mean     61.166667  400.000000
std      17.055169  105.651227
min      37.000000  228.000000
25%      46.750000  323.000000
50%      62.500000  394.000000
75%      76.000000  496.000000
max      83.000000  556.000000